server/HTTP/test/stress/GETstress.yml
config:
  target: 'http://localhost:8080'
  phases:
    - duration: 60
      arrivalRate: 190
  defaults:
    headers:
      Authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJfaWQiOiI1ZGM1MTMyNTY1YWE2MTExZTVhZmU3MzEiLCJpYXQiOjE1NzQ0MDUzMjV9.XSccek02GAgsmK2RGh4EebY96EO-U5eGug9W7Jws70o'
scenarios:
  - name: "Search and buy"
    flow:
      - post:
          url: "/search"
          body: "kw={{ keywords }}"
          capture:
            json: "$.results[0].id"
            as: "id"
      - get:
          url: "/agent/list"
      - think: 3
      - post:
          url: "/cart"
          json:
            productId: "{{ id }}"